{
    "aboutMe": "About me",
    "projects": "Projects",
    "contactMe": "Contact me",
    "professionTitle": "Full Stack Developer",
    "aboutMeDescription": "Hey there! I'm Aline but you may call me Nyh!\n I've found my passion for programming a little more than a year ago and today I'm a Web Full Stack Developer.\n I have an artistic background as a musician and tattoo artist (profession that I used to take for about 12 years), and currently I work as a Programmer Analyst at \n As a woman and a lesbian I stand for inclusion and diversity in technology!",
    "seeResume": "See resume",

    "knowledges": "Knowledges",
    "frontendKnowledges": [
        "Web applications development using HTML, CSS and Javascript",
        "Componentization and state management using ReactJS",
        "REST API's integration",
        "Responsive layouts and styling libraries such as Styled-components and Material-UI"
    ],
    "backendKnowledges": [
        "RESTful API's development using Node.js and Typescript",
        "Unit and automated tests with Jest and Mocha",
        "MySQL database",
        "Comfortable with Firebase"
    ],
    "generalKnowledges": [
        "AWS and EC2",
        "Agile Development",
        "Clean Code"
    ],
    "general": "General",

    "education": "Education",
    "webFullStackDevelopment": "Web Full Stack Bootcamp",
    "androidDevelopment": "Android Development",
    "present": "present",
    "labenuBootcampDescription": "Labenu is a startup which graduate Web Full Stack Developers ready for the job market. More than 1000 hours of programming make their students become professionals with practical knowledges on Back-end and Front-end.",
    "androidDevelopmentCourseDescription": "Native Android Development Course, taught by Jamilton Damasceno. Learning process using Android Studio IDE, Java language, SQLite database and NoSQL with Firebase.",

    "musicatchersDescription": "Full Stack Project developed at Labenu's bootcamp. It is about a web application with basic features of a music streaming Website.",
    "labedditDescription": "Project developed at Labenu's bootcamp. A social media similar to Reddit, where the users are able to post, comment and vote in each others posts. This page uses a API developed by Labenu. Mobile responsive website.",
    "astromatchDescription": "Project developed at Labenu's bootcamp. An app similar to Tinder, with fun celebrities from movies and TV where you may like, unlike and see if it's a match! :D This page uses a API developed by Labenu. Mobile responsive website.",
    "labenuSystemDescription": "Project to wrap the Backend's 4ยบ Module at Labenu. This was a team project, which the main goal was develop an education intituition system, with students, teachers and missions entities.",
    "labookDescription": "Back-end structure of Labook Project, developed at Labenu's bootcamp. An API with social media basic features.",

    "frontendOnGithub": "Front-end on Github",
    "backendOnGithub": "Back-end on Github",
    "viewCodeOnGithub": "View code on Github",
    "seeDocumentation": "See documentation",
    "openWebsite": "Open website",

    "communities": "Communities",
    "vizirDescription": "Software studio with over 10 years on the market, my current job",
    "labenuCommunityDescription": "Slack workspace with forum and culture for Labenu's students and former students",
    "codivasDescription": "Corporate agency of women in tech",
    "compiladorasDescription": "Community of women in tech, with programming booktcamps, lives and workshops",
    "gufersDescription": "Front End Users Group from Rio Grande do Sul",

    "callToActionContactText": "Did you like my work? Let's chat!",
    "phone": "Phone",
    "developedBy": "Developed by"
}