{
    "aboutMe": "Sobre mim",
    "projects": "Projetos",
    "contactMe": "Contato",
    "professionTitle": "Desenvolvedora Full Stack",
    "aboutMeDescription": "Oi tudo bem? Eu sou Aline mas pode me chamar de Nyh!\n Descobri minha paixão por programação há pouco mais de 1 ano e hoje sou Desenvolvedora Web Full Stack.\n Tenho um background artístico como musicista e tatuadora (profissão que excerci por 12 anos), e atualmente trabalho como Analista Programadora na \n Enquanto mulher e lésbica, busco somar na inclusão e diversidade na tecnologia!",
    "seeResume": "Visualizar currículo",

    "knowledges": "Conhecimentos",
    "frontendKnowledges": [
        "Desenvolvimento de aplicações Web em HTML, CSS e Javascript",
        "Componentização e manipulação de estado com ReactJS",
        "Integrações com API's REST",
        "Layouts responsivos e bibliotecas de estilização como Styled-components e Material-UI"
    ],
    "backendKnowledges": [
        "Desenvolvimento de API's RESTful utilizando Node.js e Typescript",
        "Testes unitários e automatizados com Jest e Mocha",
        "Banco de dados MySQL",
        "Familiaridade com Firebase"
    ],
    "generalKnowledges": [
        "AWS e EC2",
        "Metodologias Ágeis",
        "Clean Code"
    ],
    "general": "Gerais",

    "education": "Formação",
    "webFullStackDevelopment": "Curso Web Full Stack",
    "androidDevelopment": "Desenvolvimento Android",
    "present": "presente",
    "labenuBootcampDescription": "A Labenu é uma startup que forma Pessoas Desenvolvedoras Web Full Stack prontas para o mercado de trabalho. São mais de 1000 horas de programação que faz com que suas alunas e alunos sejam profissionais com conhecimentos adquiridos e postos em prática tanto no Back-end quanto no Front-end.",
    "androidDevelopmentCourseDescription": "Curso de Desenvolvimento Android Nativo, ministrado por Jamilton Damasceno. Aprendizado utilizando a IDE Android Studio, linguagem Java, banco de dados SQLite e NoSQL com Firebase.",

    "musicatchersDescription": "Projeto Full Stack do bootcamp da escola Labenu. Trata-se de uma aplicação com funcionalidades básicas de um site para streaming de músicas.",
    "labedditDescription": "Projeto feito no bootcamp da escola Labenu. Uma rede social similar ao Reddit, onde é possível fazer postagens, comentar nos posts de outras pessoas e votar! Essa página utiliza uma API desenvolvida pela Labenu. Site responsivo para mobile.",
    "astromatchDescription": "Projeto Astromatch do bootcamp da escola Labenu. Uma aplicação similar ao Tinder, com personalidades divertidas do cinema e TV onde você pode dar like ou não pra ver se dá match! :D Essa página utiliza uma API desenvolvida pela Labenu. Site responsivo para mobile.",
    "labenuSystemDescription": "Projeto de conclusão do Módulo 4 de Backend da Labenu. Feito em grupo, a proposta era criar um sistema da instituição de ensino trabalhando com as entidades Estudante, Docente e Turma.",
    "labookDescription": "Estrutura de back-end do Projeto Labook do bootcamp da escola Labenu. Trata-se de uma API com funcionalidades básicas de uma rede social.",

    "frontendOnGithub": "Front-end no Github",
    "backendOnGithub": "Back-end no Github",
    "viewCodeOnGithub": "Ver no Github",
    "seeDocumentation": "Ver documentação",
    "openWebsite": "Abrir site"
}